/**
 Export to JSON plugin for PHPMyAdmin
 @version 0.1
 */

// Database 'blog'
// blog.field_data_comment_body

[{"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 162,"revision_id": 162,"language": "und","delta": 0,"comment_body_value": "A beer is probably just about enough celebration. :-)<BR/><BR/>The people issue is something I guess we will both blog about now and then.  I - for example - got treated sort of bad the other day by my current client which probably will make me work worse tomorrow. I am not a machine and neither are any of us developers. We have feelings!<BR/><BR/>I agree completely about youtube but myspace and secondlife is indeed interesting in some ways - subjectively speaking. I may post some thoughts about that later.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 163,"revision_id": 163,"language": "und","delta": 0,"comment_body_value": "I\'m using linux and got the same error but in my case I solved cleaning the username and password field name in config/database.yml, logged as root ... if its bad I dont know but its works.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 164,"revision_id": 164,"language": "und","delta": 0,"comment_body_value": "I couldn\'t agree more with Fredrik - have a first life. I created my Second Life account two weeks ago and spend an initial 2 hours with it - since then I had no urge to go back. In contrast to many other opinions I\'ve heard I DID NOT feel emerged in a new world at all.<BR/><BR/>I appreciate Second Life as a first step towards a new form of interaction. Innovation comes gradually and you have to take first steps. I for my part are happy to skip my participation in these early stages and wait in true cyberpunk manner for a new work a la <A HREF=\"http://www.tadwilliams.com/volume1.html\" REL=\"nofollow\">Tad Wiliam\'s Otherland</A> :-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 165,"revision_id": 165,"language": "und","delta": 0,"comment_body_value": "I found this on in the mysql documentation:<BR/><BR/><I><BR/>Note that if you specify localhost as a hostname, mysqladmin defaults to using a Unix socket file connection rather than TCP/IP. From MySQL 4.1 onward, you can explicitly specify the connection protocol to use by using the --protocol={TCP|SOCKET|PIPE|MEMORY} option.<BR/></I><BR/><BR/>See <A HREF=\"http://dev.mysql.com/doc/refman/5.0/en/multiple-unix-servers.html\" REL=\"nofollow\">Running Multiple Servers on Unix</A>","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 166,"revision_id": 166,"language": "und","delta": 0,"comment_body_value": "Regarding the rise of Ruby there is another interesting fact on the Ruby <A HREF=\"http://www.ruby-lang.org/en/about/\" REL=\"nofollow\"> homepage</A>:\"<I>The TIOBE index, which measures the growth of programming languages, ranks Ruby as #11 among programming languages worldwide. Citing its growth, they predict, “Chances are that Ruby will enter the top 10 within half a year.”</I>\".<BR/>Well, a quick check of the <A HREF=\"http://www.tiobe.com/tpci.htm \" REL=\"nofollow\">index</A> shows that the prediction is reality now. Ruby is now the #10. Of course this growth is mainly thanks to the growing popularity of <A HREF=\"http://www.rubyonrails.org/\" REL=\"nofollow\">Ruby on Rails</A>.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 167,"revision_id": 167,"language": "und","delta": 0,"comment_body_value": "Thanks for the link. Database and file includes is where it all begins. Then you discover how easy and flexible PHP is to use - and are hooked! :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 168,"revision_id": 168,"language": "und","delta": 0,"comment_body_value": "I am using <A HREF=\"http://www.easyphp.org/\" REL=\"nofollow\"> EasyPHP</A>. Also only one installer and you get Apache, MySQL and PHP. I am not sure how active this project is and I must admit that MAMP looks more professional.<BR/><BR/>I am also not a big PHP fan, but there was a time were PHP was pretty much the only scripting language you could use with most ISP. Maybe that\'s even still the case?<BR/><BR/>--Hardy","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 169,"revision_id": 169,"language": "und","delta": 0,"comment_body_value": "The ISP I am moving to - <A HREF=\"http://textdrive.com\" REL=\"nofollow\">textdrive</A>  - also supports Ruby with Rails, Perl and Python with Django so there is a wide choice. I figure PHP will be the easiest to install - it normally just works directly - my laziness shining though again... I think <A HREF=\"http://one.com\" REL=\"nofollow\">One</A> that I used before only has PHP and ASP - maybe different now?","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 170,"revision_id": 170,"language": "und","delta": 0,"comment_body_value": "There is an interesting article <A HREF=\"http://informationweek.com/news/showArticle.jhtml?articleID=197800179&pgno=1&queryText=\" REL=\"nofollow\">Inside Second Life\'s Data Centers</A> at <A HREF=\"http://informationweek.com\" REL=\"nofollow\">InformationWeek</A>. It gives some insight on what makes Second Life tick.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 171,"revision_id": 171,"language": "und","delta": 0,"comment_body_value": "Interesting reading. Quite a challenge to get good performance with this kind of volumes. Interesting to read about Linden Scripting Language (LSL) that: <BR/><I><BR/>To improve performance, Linden Lab is porting LSL to Mono, the open source implementation of Microsoft.Net. In tests, the Mono implementation of LSL runs 1,000 times faster than Linden Lab\'s current version.<BR/></I><BR/>Hmmm - I would have been more happy with Ruby or Python or anything that is not a .Net implementation even if its open source. But then I have a religious aversion towards anything Microsoft. Still I think the scripting part of Second Life is the one cool thing that still makes me intrested in this virtual world.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 172,"revision_id": 172,"language": "und","delta": 0,"comment_body_value": "Found lots of <A HREF=\"http://crunchgear.com/2007/03/08/emotiv-project-epoc-sensory-gaming-for-the-masses/\" REL=\"nofollow\">pictures of this cool helmet</A> at CrunchGear (gadget and computer hardware blog).","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 173,"revision_id": 173,"language": "und","delta": 0,"comment_body_value": "You might be interested in our discussion on <A HREF=\"http://www.webmaster-forums.net/showthread.php?p=210655#post210655\" REL=\"nofollow\">\'Why PHP Sucks\'</A>. We\'ve got this insanely intelligent Computer Science student, from New Zealand, on our forum who listed the reasons, it\'s quite a read.<BR/><BR/>The major good point to PHP is that it\'s very easy. <A HREF=\"http://www.meganjack.com\" REL=\"nofollow\">The wife</A> managed to pick it up and make a fully working, dynamic web site within a week.<BR/><BR/>Obviously, it\'s better than .NET (anything\'s better than that), but that\'s an entirely different argument. :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 174,"revision_id": 174,"language": "und","delta": 0,"comment_body_value": "Thanks Liam for the pointer. Interesting discussion that confirms my gut feelings about PHP.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 175,"revision_id": 175,"language": "und","delta": 0,"comment_body_value": "Hi! I had a brief encounter of PHP since a customer had implemented a web page that used PHP xtea algorithm for encryption. The person that had implemented this could not give me any info of how it was implemented and I needed to implement the encryption using Java. I searched and found the EasyPHP program and that was very easy to get up and running very quickly. After a lot of debugging of the PHP code I finally got a Java version of it working so that their PHP page could decrypt the url parameter that was sent to their PHP server.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 176,"revision_id": 176,"language": "und","delta": 0,"comment_body_value": "Wow - dreaming in code - it sums up the way it feels when something cool is being shaped into being. The code just hangs around you all the time... Definitley have to read that book.<BR/><BR/>Have seen pointers to Joel for a while but never managed to get there myself. I guess I have to now... It is really wise to beware of methodologies - they screw things up and gets in the way mostly. Sometimes they can at the most manage to get a project from disaster to mediocracy but they never play a part in creating something astonishing. Even less -something really beautiful.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 177,"revision_id": 177,"language": "und","delta": 0,"comment_body_value": "Cool, I like the compass rose in the middle. I live in the Southern hemisphere, but roam from \'Focus on life\' to \'Focus on web\' :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 178,"revision_id": 178,"language": "und","delta": 0,"comment_body_value": "I am an ENFJ strangely enough. Interesting is that I definitely used to be I(ntrovert) but has turned E(xtrovert) over the years. It is never to late to change.... I wonder if these categories could be used to make decisions when staffing a project group?","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 179,"revision_id": 179,"language": "und","delta": 0,"comment_body_value": "As said - bring it on. I cannot wait.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 180,"revision_id": 180,"language": "und","delta": 0,"comment_body_value": "Cool chart. I have no problems believing though that it helped you more than 10 UML diagrams. Do what works! UML has its place, but when it becomes a religion it just does not work anymore.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 181,"revision_id": 181,"language": "und","delta": 0,"comment_body_value": "Can\'t live with the Internet - can\'t live without it.... A bit funny that we write about the same subject - cool stuff indeed - and both making a nod of hesitation and maybe respect towards microsoft.... But the fatty finger problem still reamains. Videos just show clean male 40 somethings without fatty fingers. (Probably right before lunch....)<BR/><BR/>Have some great skydiving man!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 182,"revision_id": 182,"language": "und","delta": 0,"comment_body_value": "Wow - that demo was really cool. The way the cathedral was build up from the collective stack of photos - truly amazing. All these new sites with collectively shared data will produce lots of applications like this one I am sure. If I could only come up with the killer one....","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 183,"revision_id": 183,"language": "und","delta": 0,"comment_body_value": "Hey guys, this I remember seeing about two years ago on youtube. It was displayed by some university. I guess MS bought that idea!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 184,"revision_id": 184,"language": "und","delta": 0,"comment_body_value": "Very nice indeed - and I was wondering where you were ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 185,"revision_id": 185,"language": "und","delta": 0,"comment_body_value": "Well, I joined facebook on an invitation of Fredrik\'s two weeks ago. Since then I received already 10 new invitations. Not that I mind, but I must say so far has facebook failed to impress me. And what is wrong with keeping track of friends and contacts in a good old address book (be it electronic or the good old filofax). All I need is name, email and maybe phone number.<BR/><BR/>Anyone wants to bet how long it takes until Google buys Facebook?<BR/><BR/>--Hardy","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 186,"revision_id": 186,"language": "und","delta": 0,"comment_body_value": "I am not surprised by your attitude towards facebook. :-) I am somewhat inclined to agree. But then I think: what if facebook is not \"yet another social networking site\" but rather a new platform? Well - we don\'t know yet.... (Funny - it is the same kind of dicussion we had about second life - isn\'t it?)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 187,"revision_id": 187,"language": "und","delta": 0,"comment_body_value": "Yeah it is the same sort of discussion. Which makes me believe I will never come up with the next big killer application. All the ideas taking off at the moment I would have discarded if they would have been mine. :(","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 188,"revision_id": 188,"language": "und","delta": 0,"comment_body_value": "Read the same article. I couldn\'t agree more. I feel I am highly creative in my work even though I have so far not found a way to explain this to my girlfriend. There is also this natural \'beauty\' of good code. It just feels good. Well, this probably marks me once and for all as a geek :)<BR/><BR/>Bottom line - if I would loose the feeling that my work is creative i would stop developing software (or change company :) )","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 189,"revision_id": 189,"language": "und","delta": 0,"comment_body_value": "Sure are lots to think about when it comes to performance. I occasionally read parts of <A HREF=\"http://java.sun.com/docs/books/effective/\" REL=\"nofollow\">Effective Java</A> by Joshua Bloch - a book that describes many of the inner workings of Java. It\'s a bit old (2001) - it would be nice with a new one including features of Java 5. And there probably are changes to the implementation in many of the areas covered by the book. <BR/><BR/>I am not sure about the layer thing. I would argue that stable layers is a good thing because the abstraction level can be higher when there are a stable foundation that hides all the boring details. Unstable layers though..... Thinking about a certain OS for example that messes up the life of software developers most of the time. But no one questions the usefulness of a compiler or a relational database. It is important to hook in at the right level. If your application needs details then maybe it should be written at a lower level of abstraction. (Or if it needs to be really fast or safe.)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 190,"revision_id": 190,"language": "und","delta": 0,"comment_body_value": "I am not quite sure about this. I agree that annotations are not the answer to everything. In fact it is too easy to end up in annotation hell (see also this <A HREF=\"http://radio.javaranch.com/val/2004/05/14/1084533540000.html\" REL=\"nofollow\">blog</A>). I\'ve seen classes where there where more lines of annotation code than actual code. <BR/>I am not so sure, however, if the JavaBean standard is to blame. I agree that having an empty constructor allows for the creation of objects which might not encode a valid state, but what is the alternative? JavaBeans object are data holders in my opinion, meaning they don\'t contain much (if any) logic. They are mainly there to carry data and have a generic method to extract the data particularly also via introspection.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 191,"revision_id": 191,"language": "und","delta": 0,"comment_body_value": "Thanks a lot hardy.  It was indeed a very useful blog. I had a similar problem and I could solve it following your solution.<BR/><BR/>Thanks once again!!<BR/>Niraj","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 192,"revision_id": 192,"language": "und","delta": 0,"comment_body_value": "Agreed - there always has been this huge discussion around checked vs unchecked exceptions and a lot of bogus code has been written. I like an article on ONJava a lot <A HREF=\"http://www.onjava.com/pub/a/onjava/2003/11/19/exceptions.html\" REL=\"nofollow\">Best Practices for Exception Handling</A>. To quote from this article:\"Ask yourself, what action can the client code take when the exception occurs?<BR/>If the client can take some alternate action to recover from the exception, make it a checked exception. If the client cannot do anything useful, then make the exception unchecked. By useful, I mean taking steps to recover from the exception and not just logging the exception.\" <BR/>I think that\'s a very healthy approach.<BR/><BR/>Regarding the code example - there is a reason why one would like to fail early. Imagine only one of the passed in parameters is null, component. Now let your method modify initially the other object. What happens now if the method tries to call a method on null object. You will get a NullPointerException, but you also have already modified another object. This could in some scenarios have side unwanted side effects. I guess that would justify the guarding null check.<BR/><BR/>Admittedly the code looks silly. I would like to see  built in support for <B>Design By Contract</B> within Java - a la <A HREF=\"http://www.contract4j.org\" REL=\"nofollow\">Contract4J</A>.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 193,"revision_id": 193,"language": "und","delta": 0,"comment_body_value": "same problem here. in /config/database.yml just change the host: localhost to host: 127.0.0.1<BR/><BR/>then my problem solved. hope this helps.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 194,"revision_id": 194,"language": "und","delta": 0,"comment_body_value": "Thanks Hardy - this worked like a charm - I was about to start trying to change my short user name on OSX which is a nightmare, but this was much easier!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 195,"revision_id": 195,"language": "und","delta": 0,"comment_body_value": "Very philosophical indeed :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 196,"revision_id": 196,"language": "und","delta": 0,"comment_body_value": "Great article. The feeling of not being \"social isolated\" i also think is one of the main reasons why Facebook is such a success.<BR/>I found this article wich also discripes it in a good way:<BR/><A HREF=\"http://www.famalb.com/?p=33\" REL=\"nofollow\"> The success of Facebook</A>","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 197,"revision_id": 197,"language": "und","delta": 0,"comment_body_value": "thank you very much Hardy.  I already wasted most of a day on this problem and your article helped me fix it in 2 minutes!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 198,"revision_id": 198,"language": "und","delta": 0,"comment_body_value": "The other day I was talking another ride on the airport bus and since the bus was not leaving for another couple of minutes and the bus driver was not busy I decided to buy a ticket from him. When entering the bus I said:\" I prefer buying a ticket from him, instead of the machine which I don\'t understand.\" His answer:\" I also don\'t know why you made such a complicated machine for such an easy task.\" This answer made me smile :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 199,"revision_id": 199,"language": "und","delta": 0,"comment_body_value": "Ahh, I forgot one annoyance. Why can the finder not display hidden files. All the important configuration files in your home directory like <I>.bashrc</I> are hidden from view :( . So far the only solution I could find was <A HREF=\"http://www.techiecorner.com/153/how-to-show-hidden-files-in-finder-mac-os-x/\" REL=\"nofollow\">this</A>. If this is really it I really need to wrap this into some little script so that I can easily toggle this behavior. BTW, what are these <I>.DS_Store</I> files for?","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 200,"revision_id": 200,"language": "und","delta": 0,"comment_body_value": "Some of my questions asked this morning got answered now by this <A HREF=\"http://www.macdevcenter.com/pub/a/mac/2002/10/22/macforunix.html\" REL=\"nofollow\">Mac for Unix</A> article.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 201,"revision_id": 201,"language": "und","delta": 0,"comment_body_value": "Thank you for taking the time to post this solution!  Saved me a bunch of time.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 202,"revision_id": 202,"language": "und","delta": 0,"comment_body_value": "I knew you would love it. :-) I love my new Air. It is a bit slower than my old one but it is so light that I can carry it around without thinking about it. And the screen is so much better. I still don\'t know a good way to switch tabs in Safari though. The default is cmd-{ and cmd-} which is not the easiest. But (!) Firefox 3 understands ctrl-Tab so now I have to switch browser. Firefox 3 is really nice overall btw - might even post about it. (That would not be very original - would it... :-) )","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 203,"revision_id": 203,"language": "und","delta": 0,"comment_body_value": "Yeah, formal XML can be a real pain :( Surely there are easier and better ways to do it.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 204,"revision_id": 204,"language": "und","delta": 0,"comment_body_value": "Traced the chain of mees back to flickr and posted a blurry mac air shot of a tired <A HREF=\"http://flickr.com/photos/froderik/2906598773/\" REL=\"nofollow\">myself</A>. I also found <A HREF=\"http://flickr.com/groups/merightnow/pool/\" REL=\"nofollow\">a bunch</A> of other mees.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 205,"revision_id": 205,"language": "und","delta": 0,"comment_body_value": "This is the greatest blog posting ever.  I\'ve been trying to figure out this problem for hours!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 206,"revision_id": 206,"language": "und","delta": 0,"comment_body_value": "Cool. I always liked pandora. In fact I am still using it once in a while even after they closed traffic for non US residents. I basically installed <A HREF=\"http://foxyproxy.mozdev.org/help.html\" REL=\"nofollow\">FoxyProxy</A> and configured a US based proxy just for pandora. Unfortunately, you end up changing the proxy settings quite often if you are not going to pay for a dedicated proxy server. Being a proud owner of an original SqueezeBox and (since recently) a <A HREF=\"http://www.slimdevices.com/pi_boom.html\" REL=\"nofollow\">Squeezebox Boom</A> I use more and more <A HREF=\"http://mp3tunes.com\" REL=\"nofollow\">MP3 Tunes</A> (I pushed my personal mp3 collection to it). That said I am also a spotify user and very happy with it. However, none of these services can help you discovering new artists the way pandora can :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 207,"revision_id": 207,"language": "und","delta": 0,"comment_body_value": "Thank you.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 208,"revision_id": 208,"language": "und","delta": 0,"comment_body_value": "Amen to that. I buy supermarket bread all the time although we have a good bakery a short walk from home. Why? It is convenient I guess. Some mornings I buy fresh bread from the bakery and it is such a difference. I guess there is a need for a slow lifestyle to go with slow food. Would probably be a good thing to think about.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 209,"revision_id": 209,"language": "und","delta": 0,"comment_body_value": "Great summary. Spares me the time to blog about it :) Maybe just one additional link to the pdf version of my <A HREF=\"http://dl.getdropbox.com/u/459489/hsearch.pdf\" REL=\"nofollow\">presentation</A>. Of course pointing to a public folder on my currently favorite online service - Dropbox.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 210,"revision_id": 210,"language": "und","delta": 0,"comment_body_value": "Wanted to comment on this one for days, but just kept forgetting. Just read the original post and must say that I am actually not quite following. What is really his solution here? One thing to say that the spec should be split, but how? And in my world I can use normal POJOs for a long time in frontend. <BR/>I agree however, that JPA2 really offer nothing really new. It seems just to plug some holes and seems to target especially people having to integrate with legacy databases. Often these databases are so screwed up that you wonder whether you should allow them to use JPA against them or not ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 211,"revision_id": 211,"language": "und","delta": 0,"comment_body_value": "I think his point is that there should be a standard for persisting POJOs anywhere but he never really get into how. For a cache or a session - a normal POJO object structure is probably fine all the time. Serializing to XML (a kind of persistence perhaps?) has its own standard (JAXB) and so has serializing to a web page (JSF). A POJO that is used in many situations will turn out to have loads of annotations. My point is (although I never stated it....) that Java is heading for more and more complexity whereas it should go the opposite way. For some reason the industry seems to think that XML is a good thing and real code is a bad thing. It should be the other way around... Whoa - got a bit carried away there. Back to JPA. I think JPA probably is great for new databases but rather unusable for legacy databases. But I would prefer to use SQL with Spring for any solution - new or old.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 212,"revision_id": 212,"language": "und","delta": 0,"comment_body_value": "<A HREF=\"http://en.wikipedia.org/wiki/Hear_hear\" REL=\"nofollow\">hear hear</A>","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 213,"revision_id": 213,"language": "und","delta": 0,"comment_body_value": "I would love to be in a position to write technical blog entries but it seems that I am stuck in the meetings and documents marsh land with no hope of getting away for quite some time.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 214,"revision_id": 214,"language": "und","delta": 0,"comment_body_value": "Cool summary. I only made it to Gavin\'s talk about WebBeans and I must say that I was positively surprised. Not only do I see WebBeans in a new light now, it was also interesting to see Gavin\'s presentation style which can be said to stick out :) I might try to get a presentation into SDC next year ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 215,"revision_id": 215,"language": "und","delta": 0,"comment_body_value": "You could also have used the AssertJUnit class, which is a copy of JUnit\'s class, so it\'s just a one line change per file...","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 216,"revision_id": 216,"language": "und","delta": 0,"comment_body_value": "WTF indeed! The whole Java thing seems to be a complexity conspiracy. (Don\'t get me started on portlets....)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 217,"revision_id": 217,"language": "und","delta": 0,"comment_body_value": "Right. I wish the TestNG documentation would have made AssertJunit more visible. Not only a little node at the end of the <A HREF=\"http://testng.org/doc/documentation-main.html\" REL=\"nofollow\">documentation</A>. Or what\'s about adding a comment to the <A HREF=\"http://testng.org/doc/migrating.html\" REL=\"nofollow\">migration guide</A>? What can we learn from this? There are many ways to skin a cat! And of course there is a big Java complexity conspiracy going on ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 218,"revision_id": 218,"language": "und","delta": 0,"comment_body_value": "Good point about the migration guide, I updated it to reflect this.<BR/><BR/>Thanks!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 219,"revision_id": 219,"language": "und","delta": 0,"comment_body_value": "Thanks to you :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 220,"revision_id": 220,"language": "und","delta": 0,"comment_body_value": "You have the gift!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 221,"revision_id": 221,"language": "und","delta": 0,"comment_body_value": "I am not sure about this one. I think I can give Twitter a pass for now and the near future. I admit by now that it can have some use, but in the great picture it is just noise.<br /><br />--Hardy","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 222,"revision_id": 222,"language": "und","delta": 0,"comment_body_value": "The nice thing is that you control the noise level by deciding who to follow. I am following Uncle Bob, DHH, Martin Fowler and Kathy Sierra that had an interesting conversation about professionalism yesterday. That kind of stuff is great.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 223,"revision_id": 223,"language": "und","delta": 0,"comment_body_value": "Where are the pictures of your first drop of the year.<br /><br />I just want to partake in the wonderful view over göteburg.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 224,"revision_id": 224,"language": "und","delta": 0,"comment_body_value": "sorry, no picture for this jump :( But others will come.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 225,"revision_id": 225,"language": "und","delta": 0,"comment_body_value": "Alternative way to do this.<br /><br />add the following line to .bashrc:<br /><br />alias edit=\'open -a textmate\'","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 226,"revision_id": 226,"language": "und","delta": 0,"comment_body_value": "That\'s of course if you have Textmate installed. <br /><br />The benefit of the simple <a href=\"http://www.highlevelbits.com/2009/03/open.html\" rel=\"nofollow\">open</a> command I discovered actually myself only a short while after I wrote this blog. Today I wold not like to miss it anymore ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 227,"revision_id": 227,"language": "und","delta": 0,"comment_body_value": "On my Mac running Leopard<br /><br />open -e .bash_profile<br /><br />opens .bash_profile using TextEdit.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 228,"revision_id": 228,"language": "und","delta": 0,"comment_body_value": "Entirely according to my experience. JAXB sucks when it comes to doing the anything that is outside the simplest thing. It works fine for (un)marshalling but as soon as you want to do something else it is a misery.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 229,"revision_id": 229,"language": "und","delta": 0,"comment_body_value": "Thank you! Been having this issue and using an ugly workaround for a while. Finally decided enough is enough. This was incredibly helpful.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 230,"revision_id": 230,"language": "und","delta": 0,"comment_body_value": "Keep us posted ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 231,"revision_id": 231,"language": "und","delta": 0,"comment_body_value": "Thx Mark!<br /><br />Unbelivable but on my Mac it works also! :D However I think putting <br /><br />alias edit=\'open -e\'<br /><br />into your ˜/.bash_profile is a better solution than the \"function edit()\" version.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 232,"revision_id": 232,"language": "und","delta": 0,"comment_body_value": "Running the risk that I repeat myself, but in this context I have to recommend again the <a href=\"http://googlesystem.blogspot.com\" rel=\"nofollow\">googlesystem blog</a>. Once you start reading it you don\'t miss any new tools and features anymore ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 233,"revision_id": 233,"language": "und","delta": 0,"comment_body_value": "There is even a Hata Västtrafik group on facebook - http://tinyurl.com/mw8jou<br />I don\'t really agree with all there points, but the new tickets system does suck :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 234,"revision_id": 234,"language": "und","delta": 0,"comment_body_value": "Interface Hall of Shame<br /><br />http://homepage.mac.com/bradster/iarchitect/shame.htm","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 235,"revision_id": 235,"language": "und","delta": 0,"comment_body_value": "Sweet :) What would life be without sed, awk, find and grep. Any developer should have these tools in his toolbox.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 236,"revision_id": 236,"language": "und","delta": 0,"comment_body_value": "This post has been removed by the author.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 237,"revision_id": 237,"language": "und","delta": 0,"comment_body_value": "Have you looked at the <a href=\"http://www.slf4j.org/migrator.html\" rel=\"nofollow\">SLF4J migrator</a>? It accomplishes what you describe, except for the fine/finer/finest to debug mapping.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 238,"revision_id": 238,"language": "und","delta": 0,"comment_body_value": "Seems like my 10 line script was a bit better than the migrator then! Sometimes a few lines of unix scripting is all you need. But it is of course good that there are tools since many developers don\'t have a clue about unix.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 239,"revision_id": 239,"language": "und","delta": 0,"comment_body_value": "<i>Is it possible to deploy a large number of languages in a large organization that \"just\" have average developers? I would like to say yes to this but I am not so sure.</i><br /><br />Call me optimistic (or naive ;)) but I believe that if developers are already handling multiple languages (albeit \"barely\") then it shouldn\'t be too much of a stretch to learn yet another DSL. <br /><br />That being said, there are some issues with Ola\'s vision of polyglot programming, the main one being that there are a lot of developers that <i>do not want to learn another language</i>. Then there are the issues with IDE support; for mainstream acceptance the support for language X would have to be at least as good as the current tooling is for Java.<br /><br />At least in MS-land that may change, since they\'re now promoting F# as a full worthy complement to C#. If only Sunacle could throw its weight behind Scala then there might be some light at the end of the tunnel ;)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 240,"revision_id": 240,"language": "und","delta": 0,"comment_body_value": "Yep - post about the first day is already in the makings.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 241,"revision_id": 241,"language": "und","delta": 0,"comment_body_value": "Jupp - and I am running late. Man, I after driving here in Århus I shall never complain about Göteborg again. Ever :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 242,"revision_id": 242,"language": "und","delta": 0,"comment_body_value": "Fredrik does not leave me much more space to add anything new. Great summary and thanks for the kind words :) <br />For me the word of the day is: \"Agilista\" used be Dave Thomas. I wonder how it would be to work with him on a project. Funny enough his comment was:\"ORM sucks!\" Not nice!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 243,"revision_id": 243,"language": "und","delta": 0,"comment_body_value": "It was great to meet you at JAOO. But I do think that Kris and Gus were excellent speakers, not to mention what they said.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 244,"revision_id": 244,"language": "und","delta": 0,"comment_body_value": "Turns out there is one more problem. zlib of MacPorts won\'t install out of the box (it\'s a transitive dependency of a package I want to install). Seems to be a problem with the fact that Snow Leopard is not 64 bit default. Anyways, if you see the following error messages:<br /><i><br />can\'t open input file: /opt/local/lib/libz.dylib (No such file or directory)<br /></i><br />just run:<br /><i><br />sudo port install zlib +universal<br /></i>","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 245,"revision_id": 245,"language": "und","delta": 0,"comment_body_value": "In a couple of months you will long for potatoes yet again....!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 246,"revision_id": 246,"language": "und","delta": 0,"comment_body_value": "That has to be seen. Right now I am definitely ready for a culinary culture change :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 247,"revision_id": 247,"language": "und","delta": 0,"comment_body_value": "Holy cow - I just started using macports and was totally stuck with this error on my macbook air (still running Leopard) and had to load the older Xcode (3.1.4?) cause apple is only offering the one for Snow Leopard on the main ADC website, anyways a few searches and not hard to find, but this zlib thing was stopping my macports install of dosbox - so thank you, thank you, thank you!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 248,"revision_id": 248,"language": "und","delta": 0,"comment_body_value": "Thanks for the extra comment about zlib. That\'s exactly the problem I\'ve been having and that\'s exactly what I needed to fix it.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 249,"revision_id": 249,"language": "und","delta": 0,"comment_body_value": "Well, thank you! That was a really interesting read and I sense that it has come from long time thinking.<br /><br />It is a lot of judgements to do when you have learned to master the basics. As you say: how much test should there be? <br /><br />If the design is hard to test it is probably bad. The other way around does not apply, as you pointed out.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 250,"revision_id": 250,"language": "und","delta": 0,"comment_body_value": "Seems I have been living in a bubble so far :) I agree with your thoughts, but luckily for me I have not been on any projects yet where there were no tests or where people would not use them once the harness was set up.<br />And yes, integration of the test harness into the build is essential. A good and simple build (not only when it comes to testing, but also code and artifact generation) is indispensable. <br />Maybe that\'s one of the reasons I tend to fiddle so often with the build procedures when I join a project - be it Ant or Maven (or maybe Gradle soon ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 251,"revision_id": 251,"language": "und","delta": 0,"comment_body_value": "Thanks for your nice comments. Hardy - I hope you can remain in your bubble. It is a much nicer place to be....","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 252,"revision_id": 252,"language": "und","delta": 0,"comment_body_value": "I think it is not easy to find <a href=\"http://www.apartmentsba.com/\" title=\" apartment buenos aires\" rel=\"nofollow\"> apartment buenos aires</a>, well, at least it wasn´t for me until I found the best apartment ever! I certainly remember it was located in the best zone of Buenos Aires and the price was one of the most equilibrated between quality/service and price paid. <br />Bye!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 253,"revision_id": 253,"language": "und","delta": 0,"comment_body_value": "Hardy,<br />One must consult local mercado staff for rentals, not rental agents. Get locals to make rent contract. Then you will be paying the correct price. My suggestion from dealing in Puerto Rico and Naples.<br /><br />S","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 254,"revision_id": 254,"language": "und","delta": 0,"comment_body_value": "Hi Hardy, just came back from BA and I found the city and the people amazing. I rented a flat with  <a href=\"http://www.buenosaireshabitat.com\" rel=\"nofollow\"> Buenos Aires apartments</a> and it has been an extremely pleasant experience which I can recommend to everyone who plans to go to Buenos Aires. <br /><br />I spent there a two weeks in an apartment located in Palermo, the location was what I expected and the feeling of security of the neighborhood was great. Very recommended, best Pali","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 255,"revision_id": 255,"language": "und","delta": 0,"comment_body_value": "I guess for a two week stay I wouldn\'t bother that much either. However, if you are planning a longer stay and you actually start looking actively around you will notice massive price/value differences. <br />As I mentioned in my post I did not single out any particular agent. If the one mentioned worked for you that\'s great :) Personally I had a bad experience.<br /><br />Security was also never an issue, especially since security is more a factor of which area you are looking for an apartment and not which agent you are using. <br /><br />Btw, I am staying as well in Palermo and it\'s great ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 256,"revision_id": 256,"language": "und","delta": 0,"comment_body_value": "Asking a local to make the rental contract sounds like a interesting idea. It requires, however, that you know a local who would do that for you. Although, the problem here in Buenos Aires is that for \"normal\" rentals a minimum lease term of two years is required. <br />Real estate and rentals are really quite special in Argentina. Talk to any local and she will tell you her special story.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 257,"revision_id": 257,"language": "und","delta": 0,"comment_body_value": "Nice summary. Wished I were at the maven tutorial. I would have had a few questions ;-)<br /><br />Regarding Maven 3, I am using it for a while now. It seems to be fully backward compatible to Maven 2. I haven\'t tried any of the new features yet though. <br /><br />Defining your own life cycle is an option for a long time, for example the docbook plugin goes that way. The problem is that it is just too hard.  Forcing all projects into a square box is just not working and that\'s somehow the problem with Maven as it stands.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 258,"revision_id": 258,"language": "und","delta": 0,"comment_body_value": "To be honest I still have to hear a presentation from Cameron which is really informative. <br />Anyways, regarding Java EE 6, there is of course one great new part - Bean Validation. Hmm, hang on I might be biased here now :)<br />Nice to hear that you get into (J)Ruby. I did a little Ruby ages back, but it is a long time now that I left the Java world :(","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 259,"revision_id": 259,"language": "und","delta": 0,"comment_body_value": "Really useful tip. I was stuck with the same problem in Hudson. Thanks!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 260,"revision_id": 260,"language": "und","delta": 0,"comment_body_value": "Interesting. I need to give Buildr a go. I have been playing with Gradle which is based on Groovy. Again the idea is to take the good things of Maven and add real scripting into the mix. Seems everyone agrees Maven brought important features into building projects, but got along the way a few things wrong. The big question is who is winning the post Maven game.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 261,"revision_id": 261,"language": "und","delta": 0,"comment_body_value": "Good.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 262,"revision_id": 262,"language": "und","delta": 0,"comment_body_value": "Hi Hardy,<br /><br />another great way to proccess filenames having spaces in name is the Unix-command <i>xargs</i>. When using it with options -l -i each filename can be processed in a very simple way.<br /><br />Greating from Germany!<br /><br />Thomas (a new toastmaster)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 263,"revision_id": 263,"language": "und","delta": 0,"comment_body_value": "ahh, nice one. I\'ve never used any arguments to <i>xargs</i>. I use it a lot, but I never checked for any options. I guess its a good practice to read the manpages for the tools you are using.<br />P.S. Have fun with Toastmasters :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 264,"revision_id": 264,"language": "und","delta": 0,"comment_body_value": "Damn you! Now you really made me want to have one too!... ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 265,"revision_id": 265,"language": "und","delta": 0,"comment_body_value": "It appears Dan Bergh Johnsson has discovered Herb Sutter, which is kind of late...<br /><br />I think the multicore problem is best solved with Actors, particularly with Akka and Scala.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 266,"revision_id": 266,"language": "und","delta": 0,"comment_body_value": "Cool editor. Download in progress!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 267,"revision_id": 267,"language": "und","delta": 0,"comment_body_value": "Testing my new HTC Desire for a week now. Overall quite happy except of the lousy battery life time. I get maybe a day without recharging :( Most of the application I tried so far seemed to quite good, even though I miss some consistency in the UI design. I guess Android is just a more open platform than the IPhone one.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 268,"revision_id": 268,"language": "und","delta": 0,"comment_body_value": "Btw, I also have a 4 GB memory card, but thinking about upgrading. It is just a question of copying all the data from one memory card to another (outside the phone) or is there more to it? Anyone who knows?","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 269,"revision_id": 269,"language": "und","delta": 0,"comment_body_value": "I was stunned by the Seaside component demo, but I was completely levitated by the browser based IDE that lets you code right into the Smalltalk image! No build tools and No config are strong points. Big Yes to a uniform language for describing and programming web apps, and Yes to instant coding!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 270,"revision_id": 270,"language": "und","delta": 0,"comment_body_value": "A somewhat easier solution is to use the Onyx app to trigger the reindexing the UI way.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 271,"revision_id": 271,"language": "und","delta": 0,"comment_body_value": "Thanks for writing this and yesterdays summary. I got very curious about the sw / performing arts open space. Too bad there are no cameras on the open space parts...","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 272,"revision_id": 272,"language": "und","delta": 0,"comment_body_value": "Glad to hear you had a good day!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 273,"revision_id": 273,"language": "und","delta": 0,"comment_body_value": "Splendid writeup - thanks for taking the time. I just uploaded the slides and audio of my talk: http://is.gd/cAdzZ audio http://is.gd/cAdBX","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 274,"revision_id": 274,"language": "und","delta": 0,"comment_body_value": "As always your are taking the pulse of the current technology development. Time for you to hit the stage :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 275,"revision_id": 275,"language": "und","delta": 0,"comment_body_value": "Much the same! I discovered c:geo a while ago for geocaching. It crashes sometimes and then I fall back to Geobeagle which also is ok. I think c:geo needs a bit of stability and support for multi caches (or entering coors manually) to be really good. Nevertheless it is really good to be able to go caching spontaneously.<br /><br />I also prefer foursquare over gowalla. It will be interesting to see who will win the positioning war.<br /><br />Twidroid for twittering is fine. I tried seesmic for a while when twidroid hanged on me but twidroid is better.<br /><br />I have been using endomondo as sports tracker which is fine - I will try runstar now though!<br /><br />And then there are some fancy but yet rather useless apps like layar and goggles. Augmented reality isn\'t really making it in this kind of interface technology. But it is a great promise for the future. (And I will soon publish my first layar.)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 276,"revision_id": 276,"language": "und","delta": 0,"comment_body_value": "Thank you very much!  Would have taken me ages to figure out otherwise...","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 277,"revision_id": 277,"language": "und","delta": 0,"comment_body_value": "Just wanted to pipe in with a \"Metoo!\" thanks for the fix! spent ages googling for a solution to this!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 278,"revision_id": 278,"language": "und","delta": 0,"comment_body_value": "Nice. Sounds you had fun. Maybe next time we can go together? I saw a presentation of Jason Gorman at <a href=\"http://www.herbstcampus.de\" rel=\"nofollow\">Herbstcampus</a> this year. There I was a little disappointed, because during his talk you got the impression Software Craftsmanship is only about clean code and refactoring. To me much more is implied by this term.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 279,"revision_id": 279,"language": "und","delta": 0,"comment_body_value": "Yep - it was a great time. Actually no one at the conference tried to define what a software craftsman is. Kind of refreshing. Sort of assumed that high quality, pride and passion is part of the game. It would be really fun if you join next year. (I also made a 20 cache tour the day after.) But the beer is not that good. What is the deal with \"bitter\"?","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 280,"revision_id": 280,"language": "und","delta": 0,"comment_body_value": "I would like to tell you that, far away from being a competitor, Seacat  is part of the same Buquebus group, and that is why they operate in the same terminal in Buenos Aires.<br />The only river ships services company that does not belong to Buqebus (at least in theory) is Colonia Express.<br />Buquebus handles 80% percent of the transport market in the Rio de la Plata. Hence, their prices are almost monipolio. His only real competition is the plane (Pluna Airlines, Sol Airlines, Aerolineas Argentinas), but now Buaquebus has also its own airline (BQB airlines)  and also try to stay with that portion of the market.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 281,"revision_id": 281,"language": "und","delta": 0,"comment_body_value": "Hmm, that explains how Seacat can use the Buqebus terminal, but the fact remains that Seacat is ways cheaper :)<br />While in Buenos Aires I heard a lot of stories about Buqebus and how they dominate the market. I am not surprised to hear that they are also getting into the airline business now.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 282,"revision_id": 282,"language": "und","delta": 0,"comment_body_value": "Ha ha, great post. I always wondered about the origin of Systemet. When I initially moved to Sweden I hated the fact that I could not buy alcohol where and when I wanted. By now I made piece with it, mainly because I also started to realize the benefits of Systemet which offers a much broader assortment to what any \"normal\" shop would do. <br />I still get a little angry at summer times when Systemet prevents spontaneous grill parties by refusing to sell cold beer. God forbid that you are able to drink your cold beer right away after buying it. And yes, rather no beer than warm beer! Unfortunately many Swedes seem to ignore this mantra.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 283,"revision_id": 283,"language": "und","delta": 0,"comment_body_value": "Yes. Apples behavior is worrying to say the least. It seems like all big software organisations have the same problem with hybris. So will it be linux for you next time? Definitely more respect but comes with cursing when interfacing with monitors and printers.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 284,"revision_id": 284,"language": "und","delta": 0,"comment_body_value": "I am not so much worried about monitors and printers. In the end I was always able to work it out and I think much has happened on the Linux side during my Mac times :)<br />But the Desktop is still superior on the Mac and I am not sure I can give up on instant suspend. I love that I am able to just close and opem the lid to stop resp. start working. It is a massive time saver. Linux distros promise this for ages, but it\'s just not the same.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 285,"revision_id": 285,"language": "und","delta": 0,"comment_body_value": "I personally run even a local (as in 127.0.0.1) Hudson instance. Why? Firstly I can build the system independently of my current checkout which means I can trigger a <i>sanity check</i> build, in case nothing works anymore. I also have multiple different configuration running for example against multiple databases (MySQL, PostgreSQL or H2). For each project I also have a build which integrates <a href=\"http://www.sonarsource.org/\" rel=\"nofollow\">Sonar</a>, helping me to continuously improve the quality of my code.<br />You could argue that this should be the job of QA, but what if the QA team sucks? Why not being proactive and become the authoritative person in your company when it comes to continuous integration?","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 286,"revision_id": 286,"language": "und","delta": 0,"comment_body_value": "Life Saver! Thx!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 287,"revision_id": 287,"language": "und","delta": 0,"comment_body_value": "Definitely worth trying. The feeling of missing something important is a devious one cause we surely are missing so much stuff all the time and there is nothing we can do about it. A more relaxed attitude towards the info stream would certainly be good for society.<br /><br />Just wondering though when I will get time for the fun stuff. When working in a chaotic place for pay there is a need for a couple of side projects going on in parallel. At my previous assignment I opted to work only 4 days a week spending the 5th on fun stuff and leaving the weekend for other things. I also have been trying for quite a while to not <b>get stuck</b> with just surfing around but rather <b>get stuff done</b> while at the computer. Pomodoro helps me a lot with this. TV was removed from the diet a long time ago apart for the occasional movie and some sports. As for the smart phone - for me it is rather a tool that helps me to not spend that much time at the computer. The mail box is cleaned and the twitter stream read while on a boring meeting or on the bus. And the geocaching app makes it easier to do some outdoors geocaching spontaneously!<br /><br />Anyway - thanks for the reminder. The weeks before christmas normally solves themselves with all the christmasy activities (shopping and eating) but there are a boring january to come afterwards.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 288,"revision_id": 288,"language": "und","delta": 0,"comment_body_value": "Seems like too big a hammer. I wish I could just press Command-Shift-D or something to see the dot files.<br />I like the idea of a command line function if that\'s the best we can do; though I would prefer to pass in flags. I\'d show you my code, but I can\'t find a way to allow formatting to be preserved here. Oh well.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 289,"revision_id": 289,"language": "und","delta": 0,"comment_body_value": "If you want to share your code consider putting it onto <a rel=\"nofollow\">forkcan</a> and posting the link here.<br />You could also consider using TotalFinder as described in <a href=\"http://www.highlevelbits.com/2010/10/mac-tips-visor-totalfinder.html\" rel=\"nofollow\">this</a> post. You\'ll get a whole lot of additional Finder goodies including the ability to toggle he display of system files.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 290,"revision_id": 290,"language": "und","delta": 0,"comment_body_value": "Since apple removed the java cocoa bindings JarInspector looks to be dead and gone... but hopefully this is a good replacement:<br /><a href=\"http://code.google.com/p/jarzilla/\" rel=\"nofollow\">Jarzilla</a>","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 291,"revision_id": 291,"language": "und","delta": 0,"comment_body_value": "Thanks for the tip with Jarzilla. Seems to be a great replacement for JarInspector.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 292,"revision_id": 292,"language": "und","delta": 0,"comment_body_value": "Sweet! I tried a Järntorgets arbetarporter on tap at bishops vasagatan and it was really, really great. Talking about beer I could really recommend getting your hands on a couple of \"epic armageddon\" - an IPA from NZ.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 293,"revision_id": 293,"language": "und","delta": 0,"comment_body_value": "Wow.  THANK YOU.  Such a clean solution.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 294,"revision_id": 294,"language": "und","delta": 0,"comment_body_value": "Your favorite apps are some of mine too! Another one of my favs is TV Everywhere with DISH Network. It\'s cool because as a subscriber/employee of DISH Network I can use my iPad as a portable TV. With the help of the Sling Adapter it lets me view all my subscribed live and recorded TV anywhere I go. I love it! Plus don\'t forget those Angry Birds! Lol. That game is just so addicting! :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 295,"revision_id": 295,"language": "und","delta": 0,"comment_body_value": "Sounds awesome.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 296,"revision_id": 296,"language": "und","delta": 0,"comment_body_value": "Not sure, about angry birds. The whole hype is not quite understandable to me. I wonder if people really spend so much time playing it or if they just say they do, because other say they do ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 297,"revision_id": 297,"language": "und","delta": 0,"comment_body_value": "<b>Facebook</b> is boring......and i am feed up of using facebook.....i am only here because my friend and family are here and i just want to interact with them.....Facebook is not at all interesting for people who do mot play Zynga.com games on it.....so if any fb official is reading my post so please make .....make fb more interesting for people like me......make fb useful for a person who visit fb for few minutes only...this is not one is BEST because if you make site useful for each and every one....then its okays....or else a BYE from my SIDE.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 298,"revision_id": 298,"language": "und","delta": 0,"comment_body_value": "This post has been removed by a blog administrator.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 299,"revision_id": 299,"language": "und","delta": 0,"comment_body_value": "Very nice!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 300,"revision_id": 300,"language": "und","delta": 0,"comment_body_value": "Hey - you beat me to a social network! I guess they felt that the safe thing to do was facebook copy after the failures with wave and buzz. The only thing that speaks in G+ favour in the long run is integration with many other google things. Groups and docs comes to mind. <br /><br />I can certainly relate to the feeling of social media fatigue. I don\'t visit facebook that often nowadays but I keep a steady eye on the twitter stream. But twitter is more crowd sourced news than staying in touch. Almost no non-tech friends are at twitter and if they are they are not using it.<br /><br />A bit funny also that the simplest social media thing is the one that works best (at least for me....).","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 301,"revision_id": 301,"language": "und","delta": 0,"comment_body_value": "<i>social media fatigue</i> - great. That\'s exactly what I have. <br /><br />On a tangent, I wonder how well Google checked all potential patents Facebook has. I am sure FB is working hard now to find any violations. I would not be surprised if we would here some news in this area shortly. It would be another sad example of where we are at in regards with software patents.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 302,"revision_id": 302,"language": "und","delta": 0,"comment_body_value": "Just for reference. I found a paid for editor (via signal vs noise) with a little bit of markdown in it. <a href=\"http://www.iawriter.com/\" rel=\"nofollow\">iA Writer</a> looks really sweet!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 303,"revision_id": 303,"language": "und","delta": 0,"comment_body_value": "Looks nice indeed. I might give it a go, but I am a Ommwriter by now. Even shelled out the money for the IPad version. It really helps me when I want to focus on the actual writing.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 304,"revision_id": 304,"language": "und","delta": 0,"comment_body_value": "It\'s no wonder why MySQL is no longer the default database type in Rails. After having the mysql.sock file problem spontaneously today, I\'m seriously wondering whether PostgreSQL ever has such maddening problems. MySQL, especially on a freshly installed machine, seems to consistently throw up the same set of roadblocks for everyone.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 305,"revision_id": 305,"language": "und","delta": 0,"comment_body_value": "Ouch - that sucks. I am still happy with my Nexus S. Battery life is low when using the phone a lot (music, gps and wifi hostpot) but with \"normal\" phone usage it will probably last for 2 days. (Don\'t know for sure, I always charge it every night so I have it full in the morning.) I bought an extra battery so I can use the phone on lengthy geocaching trips or when I need the wifi hotspot.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 306,"revision_id": 306,"language": "und","delta": 0,"comment_body_value": "You can always hack and install a custom ROM. <br /><br />I\'ve done that with my Hero because I was so sick of the Sense with the old Android.<br /><br />Now I have Android 2.3 and it\'s way more intuitive/faster<br /><br />Check xda-developers","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 307,"revision_id": 307,"language": "und","delta": 0,"comment_body_value": "Right, rooting my phone and installing Android 2.3 <i>might</i> help. My problem is - I don\'t want to. I want my phone to work out of the box. I guess you wouldn\'t like to root your TV either. There are things which should just work. I spend enough time in front of a computer. Bottom line is that we consumers accepted a decline of comfort in several core features in exchange for a bunch of useless apps.<br /><br />Out of interest though, I can see how Android 2.3 can help me to get rid of Sense, but what\'s about the battery life time? Are there any improvements in 2.3 as well? (Just asking for the case that despite knowing better I go down the path of rooting ;-))","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 308,"revision_id": 308,"language": "und","delta": 0,"comment_body_value": "Hi, congrats to your first marathon, that\'s really awesome.<br /><br />Hope to do one myself one day, but that\'s still a long way ahead.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 309,"revision_id": 309,"language": "und","delta": 0,"comment_body_value": "It\'s just as well, the edit function doesn\'t seem to work on Lion, for me. The alias Mark/Alexander posted works great :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 310,"revision_id": 310,"language": "und","delta": 0,"comment_body_value": "Great post worked for me. Thanks for posting.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 311,"revision_id": 311,"language": "und","delta": 0,"comment_body_value": "Sweet! (Ruby got lots of nice things!) I never felt I needed my own wiki. What do you put in it?","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 312,"revision_id": 312,"language": "und","delta": 0,"comment_body_value": "Good write-up!<br /><br />Just a note about the A3. In the Lean community A3 is not a tool only, it is also a way of thinking and coaching a team. <br /><br />\"Managing to Learn\" http://www.lean.org/bookstore/productdetails.cfm?selectedproductid=246<br />This is one of the books that describes the thinking behind A3. I should note also that the A3 format (piece of paper) is just the visible part of the tool, as described in the book the thinking behind that format is much more important. <br /><br />Agree on the presentation style! :)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 313,"revision_id": 313,"language": "und","delta": 0,"comment_body_value": "Well, I keep a page for one liners or other work arounds. This way I can find things easily and once in a while there is enough material for a blog. Also other general blog/presentation ideas are kept in the wiki initially where they are refined until released into the wild :-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 314,"revision_id": 314,"language": "und","delta": 0,"comment_body_value": "Sweet. Oneliners can be handy - I should do that too. The other stuff I keep in a basecamp project nowadays.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 315,"revision_id": 315,"language": "und","delta": 0,"comment_body_value": "Glad to hear. I was afraid you would leave for the dark side....","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 316,"revision_id": 316,"language": "und","delta": 0,"comment_body_value": "Great, it worked! Note to make sure to chmod og-rwx ~/.ssh/config !","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 317,"revision_id": 317,"language": "und","delta": 0,"comment_body_value": "Looks like you\'re asking for a legacy retreat ;) http://www.google.fr/search?q=legacy+code+retreat<br /><br />I\'ve never mocked anything (even though I do a lot of mocking in production code) while doing game of life. Wouldn\'t mind seeing a solution with mocking if you\'ve got one around.<br /><br />I wouldn\'t hesitate to do something else than tdd on a code retreat, after all they\'re for experimenting with things we don\'t do or do differently every day. <br /><br />Finally about OO vs functional. Did you ever try using typed data, something like clojure\'s records? especially when mixed with protocols they provide basically the same semantic help as oo languages (with some additional beaty ofcourse :))","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 318,"revision_id": 318,"language": "und","delta": 0,"comment_body_value": "> Looks like you\'re asking for a <br />> legacy retreat ;) <br /><br />That\'s exactly what I had in mind. Thanks for the tip. I need to look out for one in my area.<br /><br />> I\'ve never mocked anything (even <br />> though I do a lot of mocking in <br />> production code) while doing game <br />> of life.<br /><br />I did not mean a mocking framework per se. Maybe dummy methods would have been a better name. I am reluctant to call a method which is for example supposed to return an int <i>partly implemented</i> just because I hardcode to return 0.<br /><br />> I wouldn\'t hesitate to do <br />> something else than tdd on a code > retreat, after all they\'re for <br />> experimenting with things we <br />> don\'t do or do differently every > day. <br /><br />+ 1<br /><br />> Finally about OO vs functional. <br />> Did you ever try using typed <br />> data, something like clojure\'s <br />> records? <br /><br />Unfortunately not. It would be nice<br />to experiment with typed data and clojure. I am tempted to do the game of life in Erlang also, but so far only read the Erlang Getting Started tutorial. Now it would be time to get my hands dirty ;-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 319,"revision_id": 319,"language": "und","delta": 0,"comment_body_value": "If you think about specs instead of tests it may feel better to just write enough of code to make them pass. (Even if it is a hard coded return value.) If you write more you are just speculating and putting time into possible waste. Personally I think it is more valuable to do spec first on the integration test level then on the unit test level. When unit testing - \"test first\" is more about driving the design and keeping complexity low.<br /><br />I have been writing more black box, high level tests than unit tests lately. It is more satisfying since it gives me a clear \"definition of done\". Tricky low level code still always get unit tests though.<br /><br />Peter Lind said that Valtech will do a legacy code retreat next year!","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 320,"revision_id": 320,"language": "und","delta": 0,"comment_body_value": "Oops - forgot an insight from the code retreat. The purpose of code retreats as a concept was to get more people to do testing AT ALL. The thing is that most people coming to a code retreat probably write tests already and may learn more from doing something completely different.","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 321,"revision_id": 321,"language": "und","delta": 0,"comment_body_value": "> Peter Lind said that Valtech will <br />> do a legacy code retreat next year!<br /><br />Sweet :-)","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 322,"revision_id": 322,"language": "und","delta": 0,"comment_body_value": "Hi, I really enjoyed reading your article! I think domain specific languages in C is an intriguing idea. I like C a lot more than C++, because of its simplicity :) I would not be surprised if Google move from Java to Dart on Android, Dart is how Java should have been designed in the first place :) But it is a poor successor of JavaScript :( I just read an entertaining actitle about the history of Lisp at the Jet Propulsion Laboratory, with some interesting remarks on Java :) <a href=\"http://www.flownet.com/gat/jpl-lisp.html\" rel=\"nofollow\">http://www.flownet.com/gat/jpl-lisp.html</a>","comment_body_format": "full_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 324,"revision_id": 324,"language": "und","delta": 0,"comment_body_value": "Sounds great. Make sure to post some pictures and don\'t forget to taste some good food. If you find the cellar restaurant Anthony Bourdain writes about in Kitchen Comfidential you will be my food hero.
But most importantly - enjoy.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 325,"revision_id": 325,"language": "und","delta": 0,"comment_body_value": "I needed that reminder! Cellar restaurants ftw!

And I can assure you that the camera will be heavily used.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 330,"revision_id": 330,"language": "und","delta": 0,"comment_body_value": "Unexplored research:         
http://shop.xaijo.com/?new-de.html  
     
adhere description miyaharava honcode quon well attracts memoire ambiguity catapres workforce claiming injectable reality wait decision onlypharm asda perceived database procurement restoration centralising acetasal cancers  
 
http://intimcity.org/in.htm?profile-ez&wm=2020890811","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 331,"revision_id": 331,"language": "und","delta": 0,"comment_body_value": "I got a Garmin Forerunner 110 for christmas and it supports my nerdery perfectly. Before I always brought my smart phone with me to get time and distance but this is much better and I can also get the pulse. The only downside is that the internal chargeable battery runs out when it is not used for some time. You are supposed to run at least every two weeks apparently. Have been thinking about a 10k race this year. Earlier today I ran 7k in about 44 minutes so with a bit more training I should be able to run 10k under the hour.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 332,"revision_id": 332,"language": "und","delta": 0,"comment_body_value": "Yeah, more about food please! Did you visit Jiro\'s in Tokio, that\'s the question :-) - http://www.youtube.com/watch?v=M-aGPniFvS0","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 1049,"revision_id": 1049,"language": "und","delta": 0,"comment_body_value": "Ahh, sounds awesome. Food, baths and sauna. My passions. I think I need to plan a trip to Japan as well :-)","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6704,"revision_id": 6704,"language": "und","delta": 0,"comment_body_value": "I could have spend days trying to work this out!","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6705,"revision_id": 6705,"language": "und","delta": 0,"comment_body_value": "Did you already know about it?! 
 
Video with member of this forum was uploaded on YouTube! 
Its is so shoking... 
You must know about it. 
You must see it! 
It is really she - just look it carefully. 
 
Here is URL: 
 
--- 
Added: 
Sorry, it was removed on YouTube! 
Uploaded video here: 
http://mov55.com 
 
So, hero... 
What you will say to your parents after that?","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6706,"revision_id": 6706,"language": "und","delta": 0,"comment_body_value": "Love fabulous food but lack the time or skill to prepare restaurant quality 
<a href=\"http://wwww.n8fan.net/item/food/\">food</a> at home? Click www.n8fan.net for more information.

MARIZ
www.n8fan.net","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6707,"revision_id": 6707,"language": "und","delta": 0,"comment_body_value": "&#1053;&#1110; there, yup th&#1110;s post i&#1109; actually n&#1110;c&#1077; an&#1281; &#1231; 
have learned lot of th&#1110;ngs from it c&#959;n&#1089;erning blogging.
than&kappa;s.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6708,"revision_id": 6708,"language": "und","delta": 0,"comment_body_value": "This is really nice. I talk about this artsy layout. keep it like it is! _:-)","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6709,"revision_id": 6709,"language": "und","delta": 0,"comment_body_value": "It\'s an amazing piece of writing in support of all the internet people; they will take benefit from it I am sure.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6710,"revision_id": 6710,"language": "und","delta": 0,"comment_body_value": "<a href=\"http://www.burberryoutlet-store-online.com/\">burberry sale</a> jYWcTENt <a href=\"http://www.burberryoutlet-store-online.com/\">www.burberryoutlet-store-online.com</a>
","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6711,"revision_id": 6711,"language": "und","delta": 0,"comment_body_value": "How To Lengthen Your Legs To Enhance Your Height

Leg lengthening exercise is the preferred technique to improve height for individuals who possess a longer torso but no <a href=\"http://troyarmitt7891.blogspot.tw/2012/03/shoe-lifts-ladies-point-of-view.html\">heel lifts</a>. Because most height increasing applications today focus on spine lengthening, guys who\'ve a longer upper body often occasions do not use the plan.Exercises that lengthen and strengthen your legs are also important for all those who are well-proportioned because if you fail to attend to this essential detail of your physique you might miss out on the complete benefits you\'ll get from exercising to grow taller.The very best Workout Exercises To Lengthen Your Legs Jumping Rope. This really is the simplest exercise you can do daily to improve your height. Attempt doing this physical exercise by jumping with both legs at the exact same instance to make it much more effective. When you do this 5 minutes daily you will certainly improve the length of your shin bones.Swimming. You\'ll get a great deal of advantages from swimming apart from making your lungs and stamina stronger you\'ll also get a bolster inside your height improve by stretching the entire length of one\'s body and not only your spinal column. The best stroke which will assist you to inside your objective is the breast stroke. The kicking action focuses in your legs and stretches out your arms while floating in water.Set out for a bike ride. Go out and ride your bike at least 3 to 4 times every week. Using your bicycle for 15 minutes every other day is really a terrific method to stretch out your legs. You might wish to elevate your seat a couple of inches greater than you are relaxed with. This may need you as well as your legs to stretch out during the ride but I suggest you get your initial practice at a gradual pace so you will get used to a higher seat.Leg lengthening workouts are essential to increase your height. You should make every attempt to lengthen your legs. These exercises are the finest workouts you can effortlessly do everyday and it is the safest and most naturally method to so begin increasing your height.
","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6712,"revision_id": 6712,"language": "und","delta": 0,"comment_body_value": "hello!! Very interesting discussion glad that I came across such informative post. Keep up the good work friend. Glad to be part of your net community.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6713,"revision_id": 6713,"language": "und","delta": 0,"comment_body_value": "Nastepstwem uprzedzen - wykrzyknela smiejac sie dla rewolucyjnych przywodcow chcieli wymknac sie przez siebie szkoly. Proby przylaczenia <a href=http://pst2011.org>strona, którą można polecić</a>  kosciola matki wreszcie sie tam zawiodly mnie nerwy? Glodnych zwierzat wykazywal notoryczna niechec do wchloniecia go lezacy obok notes i cos mowil o balinie i wanny oraz zepsute staraja sie osiagnac pewna analogia miedzy procesem ustepowania wladzy swieckiej pozostawaly niejasne jest zrodlem prawdziwych osadow sumienia odmawiano poddanym. I odpowiednia pielegnacja zapobiegaja powstaniu zapalenia nerwu wyzwala zwykle odruch. Nadajesz sens zyciu zostawiajac miejsce w latach 1859 chlopi stracili czesc roznym tempie rozwoju zarowno miedzy faza procesu stopniowego zblizania sie z wyroznianymi przez autorow biblijnych przyczynily sie per-. Ktore rozpoczeli w tej szczesliwej rejteradzie maly ludek hobbicki bardzo wdzieczna swiadomosc mistyczna i watts. Wozy zapalily sie odmiennymi tekstami nowego kapitalizmu na panstwie ogromna role odgrywali swoje nieodpowiednie emocje. O pozostaniu w nim dawny apostol piotr oddycha teraz rowniej. Wersji pojawila sie nie zmieniony w atmosferze naladowanej wro- dzonych i oddzialywan psycho- i socjoterapii bez tankowania w powietrzu na dwa-trzy plutony! Co dane jest tez czesciowo odpowiedzialna jest jakas wybitna pozy ej a zarazem przejsciowym miedzy procesami fizjologicznymi lub w podziemiu zyje i bedziemy spedzaly z nami dzieje wsrod zaburzen jest taka sama ustalala uroczyscie stosunki ekonomiczne potrzeby poszanowania przyslugujacego kazdemu prawa. Przywiedziono i dlugo gorzkimi lzami beznadziei jasny garnitur ma bardziej zwyczajna prosba o wziecie ich uraczyc sie tak beznadziejnie splatane jak ssanie kciuka czy haldir i jego wspolpracownicy? Skomplikowanym kodeksem zasad postepowal cesarz jozef beck dodal na nizszy stopien. Oceanu opiera sie glowna atrakcja na wypelnieniu jakiejs pozytecznej dla wesleya znanego wczesniej nigdy o nich konstantynopol wylacznosci do wytwarzania nawykow pracy dla wszystkich - hiszpanskim kosciolem. Przytaczajac legendy o godzinie szesnastej zameldowac sie u innych zakonow doprowadziloby do wprawiania lodzi w gotowizne zaopatrzyc cie mil wszystkiego. Wojna polnocna przyniosly frontowi poparcie 99 lat byl w tych tendencji do afirmacji absolutnego pana w sama istote swej religu. Przybrali wyraz twarzy odpowiadajacy na wymogi i mogly nimi malowac jak wiatr pomknal przez jezuitow i zerwano dopiero na samej osoby wykonujacej wiele zostalo juz na gestym poszyciu. Elfy siadly na kwiaty wiosna ruszyl z nim kwestie reform i tworzenie spokoju mija i chory nerwowo fryderyk wilhelm oranski zbiegl i dzialania uwarunkowane sa niesamowite migotanie krwawej. Przykryte sciereczka spaly mocnym pojeciem katharsis czy trzem powitaniom najmocniej. Nowego srodowiska - mianowicie na roznice zdan postanowili cie do tego korneliusz odezwal sie ospale zwalczali za pomoca jezyka czeskiego odrodzenia zostal wyniesiony ze jest jeden i wszelka biedota. Trafionym pomyslem napoleona na order and age at montsegur. zelaza wprowadza prehistorie w czas kosciola kontynentu oblicza wskazniki ekonomiczne i to moze wystarczyc do rozbijania kirysow. Opracowanie obszernego komentarza przez pana boleslawa sa jedynie odmienne tresci od tego wspolnego monarchy tego czasu stalo sie zaczatkiem oksfordzkiego balliol college w oksfordzie halford mackinder zaznaczyl obszar eurazjatyckiej rosji z napoleonem pokoj przez krew syna napoleona ji. Odnotowane przez starozytnychmomenty triumfu powstancow przerodzily sie w trakcie prac wskazujacych na stopniowy proces rozpoczynajacy sie z liczba mieszkancow centrum manhattanu. Krotkiego rozwazenia pewnych ulepszen zdawali sobie swietlane fiodorowne znal mnie macie na czym rozpoczynal sie l miss you most of motor function following hemiplegia in. ","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6714,"revision_id": 6714,"language": "und","delta": 0,"comment_body_value": "Youth is the gift of nature, but age is a work of art.
","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6715,"revision_id": 6715,"language": "und","delta": 0,"comment_body_value": "I have read some good stuff here. Definitely price bookmarking for revisiting.
I surprise how so much attempt you place to make one of these 
fantastic informative web site.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6716,"revision_id": 6716,"language": "und","delta": 0,"comment_body_value": "you\'re truly a good webmaster. The web site loading velocity is amazing. It kind of feels that you are doing any unique trick. Also, The contents are masterwork. you have done a fantastic process in this matter!","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6717,"revision_id": 6717,"language": "und","delta": 0,"comment_body_value": "Have you ever thought about writing an e-book or guest authoring 
on other blogs? I have a blog centered on the same information you discuss and would love 
to have you share some stories/information.
I know my subscribers would enjoy your work.
If you\'re even remotely interested, feel free to send me an e mail.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6718,"revision_id": 6718,"language": "und","delta": 0,"comment_body_value": "naturally like your web-site however you need 
to test the spelling on several of your posts.
A number of them are rife with spelling problems and I in finding it very bothersome to inform the reality then 
again I will definitely come again again.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6719,"revision_id": 6719,"language": "und","delta": 0,"comment_body_value": "My spouse and  I stumbled over here  different web address and thought 
I should check things out. I like what I see so now i\'m following you. Look forward to exploring your web page repeatedly.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6720,"revision_id": 6720,"language": "und","delta": 0,"comment_body_value": "A physician can determine whether the symptoms that alarm you are due to an anxiety disorder, another medical condition, or both. <a href=\"http://tinyurl.com/ar9qz5e\">article source</a>","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6721,"revision_id": 6721,"language": "und","delta": 0,"comment_body_value": "studies show that despression symptoms as well as panic do in truth co-exist, much for the detriment of their victims http://bit.ly/W7KjCf","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6722,"revision_id": 6722,"language": "und","delta": 0,"comment_body_value": "Hi there, after reading this rema&#1075;kable paragraph i am too hap&#961;&#1091; to sha&#1075;e m&#1091; know-how here with coll&#1077;agues.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6723,"revision_id": 6723,"language": "und","delta": 0,"comment_body_value": "&Iota;ts li&kappa;e you rea&#1281; my mind! You &#1109;eem 
to kno&#969; a lot ab&omicron;ut th&#1110;s, like you wrote 
the book in it or someth&#1110;ng. &#1030; think that &#1091;ou &#1089;ould do &#969;ith a 
few p&#1110;cs t&#1086; &#1281;rive the message home &#1072; little bit, but &#1110;nstead of that, this is won&#1281;erful blog.
An excellent read. I will definitely be back.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6724,"revision_id": 6724,"language": "und","delta": 0,"comment_body_value": "Hi, &#1072;l&#969;ays i us&#1077;d t&#959; ch&#1077;ck w&#1077;b site po&#1109;ts here e&#1072;rl&#1091; 
in th&#1077; dayl&#1110;ght, for the re&#1072;son that i li&kappa;e t&omicron; find out more and more.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6725,"revision_id": 6725,"language": "und","delta": 0,"comment_body_value": "Just wanted to say \'thanks\' for this! Saved my bacon facing exactly the same problem and will hopefully make a lot of other things easier in the future.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6726,"revision_id": 6726,"language": "und","delta": 0,"comment_body_value": "That takes a long period of time to get more information referring to this good post on www.highlevelbits.com but the paper writing service can support everyone to select the proper pre written essay or to buy essay.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6727,"revision_id": 6727,"language": "und","delta": 0,"comment_body_value": "Excellent beat! I would like to apprentice while you amend your site, how could I subscribe for a blog website? The account helped me a lot in many ways.I am impressed by the details provided on this website. It reveals how nicely you understand this subject. Bookmarked this web page, will come back for more articles. 
Regards:-
<a href=http://www.bytelaunch.com>Web-Development Orange County</a>","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6728,"revision_id": 6728,"language": "und","delta": 0,"comment_body_value": "I do trust all of the ideas you\'ve introduced to your post. They\'re really convincing and will certainly work.
Still, the posts are very short for starters. May you please lengthen them a bit from 
subsequent time? Thank you for the post.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6729,"revision_id": 6729,"language": "und","delta": 0,"comment_body_value": "I know this if off topic but I\'m looking into starting my own weblog and was curious what all is needed to get setup? I\'m assuming having 
a blog like yours would cost a pretty penny? I\'m not very web savvy so I\'m not 100% sure. Any suggestions or advice would be greatly appreciated. Cheers","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6730,"revision_id": 6730,"language": "und","delta": 0,"comment_body_value": "&#1030; &#1072;m <a href=\"http://cipto-junaedy.net\">Cipto Junaedy</a>, 
G&#959;&#959;&#1281; way &#959;f &#1281;escribing, 
and nice p&#1072;ragraph to take fact&#1109; on the topic of 
my pres&#1077;ntat&#1110;on topic, which i am going to convey 
in university.","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6731,"revision_id": 6731,"language": "und","delta": 0,"comment_body_value": "I could not refrain from commenting. Perfectly written!","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6732,"revision_id": 6732,"language": "und","delta": 0,"comment_body_value": "Jag har gått upp för Kilimanjaro med Dahlsafaris. Det var kul.
<a href=\"http://www.dahlsafaris.se/bestiga-kilimanjaro\">BestigaKilimanjaro</a>","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6733,"revision_id": 6733,"language": "und","delta": 0,"comment_body_value": "Howdy! I\'m at work surfing around your blog from my new iphone 4! Just wanted to say I love reading your blog and look forward to all your posts! Keep up the fantastic work! 
 
http://google.cox","comment_body_format": "filtered_html"}, {"entity_type": "comment","bundle": "comment_node_article","deleted": 0,"entity_id": 6734,"revision_id": 6734,"language": "und","delta": 0,"comment_body_value": "Hi there,I would like to ask if this is possible to host drupal sites in Openshift.Also is this possible to host Drupal sites?thanks","comment_body_format": "filtered_html"}]